#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_static_site.crc-sox: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/staticSites/CRCSOX-Client-Dev][0m
[0m[1mazurerm_service_plan.service: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/serverfarms/CRCSOX-Service-Plan][0m
[0m[1mazurerm_windows_function_app.crcsox: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/sites/CRCSOX-Dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # azurerm_static_site.crc-sox[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_static_site" "crc-sox" {
      [33m~[0m [0m[1m[0mapi_key[0m[0m             = "bdf61a5b714aabfc84c82112f3db1a2279809f4f4d48d7e7d401582ea86cdc912-bdb9376b-9655-421a-956c-8256b8c7a398010142451" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdefault_host_name[0m[0m   = "mango-sky-08a703610.2.azurestaticapps.net" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                  = "/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/staticSites/CRCSOX-Client-Dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                = "CRCSOX-Client-Dev" [33m->[0m [0m"CRCSOX-Client-Test" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mtags[0m[0m                = {
          [33m~[0m [0m"ENV" = "dev" [33m->[0m [0m"test"
        }
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_windows_function_app.crcsox[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_windows_function_app" "crcsox" {
      [31m-[0m [0m[1m[0mapp_settings[0m[0m                      = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mcustom_domain_verification_id[0m[0m     = (sensitive value)
      [33m~[0m [0m[1m[0mdefault_hostname[0m[0m                  = "crcsox-dev.azurewebsites.net" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mhttps_only[0m[0m                        = false [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                                = "/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/sites/CRCSOX-Dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m   = "SystemAssigned" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mkind[0m[0m                              = "functionapp" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                              = "CRCSOX-Dev" [33m->[0m [0m"CRCSOX-Test" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0moutbound_ip_address_list[0m[0m          = [
          [31m-[0m [0m"20.84.239.140",
          [31m-[0m [0m"20.84.239.154",
          [31m-[0m [0m"20.84.239.157",
          [31m-[0m [0m"20.84.239.165",
          [31m-[0m [0m"20.84.239.200",
          [31m-[0m [0m"20.84.239.205",
          [31m-[0m [0m"20.118.56.7",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0moutbound_ip_addresses[0m[0m             = "20.84.239.140,20.84.239.154,20.84.239.157,20.84.239.165,20.84.239.200,20.84.239.205,20.118.56.7" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpossible_outbound_ip_address_list[0m[0m = [
          [31m-[0m [0m"20.84.239.140",
          [31m-[0m [0m"20.84.239.154",
          [31m-[0m [0m"20.84.239.157",
          [31m-[0m [0m"20.84.239.165",
          [31m-[0m [0m"20.84.239.200",
          [31m-[0m [0m"20.84.239.205",
          [31m-[0m [0m"20.84.239.216",
          [31m-[0m [0m"20.84.239.239",
          [31m-[0m [0m"20.109.248.5",
          [31m-[0m [0m"20.109.248.37",
          [31m-[0m [0m"20.109.248.43",
          [31m-[0m [0m"20.109.248.57",
          [31m-[0m [0m"20.109.248.154",
          [31m-[0m [0m"20.109.248.160",
          [31m-[0m [0m"20.109.248.165",
          [31m-[0m [0m"20.109.248.166",
          [31m-[0m [0m"20.109.248.168",
          [31m-[0m [0m"20.109.248.201",
          [31m-[0m [0m"20.109.248.202",
          [31m-[0m [0m"20.84.237.24",
          [31m-[0m [0m"20.109.248.219",
          [31m-[0m [0m"20.109.248.222",
          [31m-[0m [0m"20.109.249.102",
          [31m-[0m [0m"20.109.249.122",
          [31m-[0m [0m"20.109.249.124",
          [31m-[0m [0m"20.109.249.126",
          [31m-[0m [0m"20.109.249.129",
          [31m-[0m [0m"20.109.249.134",
          [31m-[0m [0m"20.109.249.152",
          [31m-[0m [0m"20.109.249.159",
          [31m-[0m [0m"20.118.56.7",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m    = "20.84.239.140,20.84.239.154,20.84.239.157,20.84.239.165,20.84.239.200,20.84.239.205,20.84.239.216,20.84.239.239,20.109.248.5,20.109.248.37,20.109.248.43,20.109.248.57,20.109.248.154,20.109.248.160,20.109.248.165,20.109.248.166,20.109.248.168,20.109.248.201,20.109.248.202,20.84.237.24,20.109.248.219,20.109.248.222,20.109.249.102,20.109.249.122,20.109.249.124,20.109.249.126,20.109.249.129,20.109.249.134,20.109.249.152,20.109.249.159,20.118.56.7" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msite_credential[0m[0m                   = [
          [31m-[0m [0m{
              [31m-[0m [0mname     = "$CRCSOX-Dev"
              [31m-[0m [0mpassword = "pp9NJnpFjDFHvnkdiPcsynnfR3E9T7agWQrngsoC7R7QWetu4qlCjGXqgCze"
            },
        ] [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                              = {} [90m->[0m [0m[90mnull[0m[0m
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mauth_settings {
          [33m~[0m [0m[1m[0madditional_login_parameters[0m[0m    = {} [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = [] [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [33m~[0m [0m[1m[0menabled[0m[0m                        = false [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [33m~[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mtoken_store_enabled[0m[0m            = false [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mapp_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m            = (known after apply)
            }

          [32m+[0m [0mgithub {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mconsumer_secret_setting_name[0m[0m = (known after apply)
            }
        }

      [33m~[0m [0msite_config {
          [33m~[0m [0m[1m[0malways_on[0m[0m                         = false [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mapp_scale_limit[0m[0m                   = 200 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdefault_documents[0m[0m                 = [
              [31m-[0m [0m"Default.htm",
              [31m-[0m [0m"Default.html",
              [31m-[0m [0m"Default.asp",
              [31m-[0m [0m"index.htm",
              [31m-[0m [0m"index.html",
              [31m-[0m [0m"iisstart.htm",
              [31m-[0m [0m"default.aspx",
              [31m-[0m [0m"index.php",
            ] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdetailed_error_logging_enabled[0m[0m    = false [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0melastic_instance_minimum[0m[0m          = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhealth_check_eviction_time_in_min[0m[0m = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mip_restriction[0m[0m                    = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mpre_warmed_instance_count[0m[0m         = 0 [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m          = (known after apply)
          [31m-[0m [0m[1m[0mruntime_scale_monitoring_enabled[0m[0m  = false [90m->[0m [0m[90mnull[0m[0m
          [33m~[0m [0m[1m[0mscm_ip_restriction[0m[0m                = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mscm_type[0m[0m                          = "None" [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mwindows_fx_version[0m[0m                = (known after apply)
          [33m~[0m [0m[1m[0mworker_count[0m[0m                      = 1 [33m->[0m [0m(known after apply)
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @charliedalldorf, Action: `pull_request`*